amrithmmh/ek-tm4c123gxl/examples/blink/build/startup_gcc.s
	.cpu cortex-m4
	.eabi_attribute 27, 1
	.eabi_attribute 28, 1
	.eabi_attribute 20, 1
	.eabi_attribute 21, 1
	.eabi_attribute 23, 3
	.eabi_attribute 24, 1
	.eabi_attribute 25, 1
	.eabi_attribute 26, 1
	.eabi_attribute 30, 6
	.eabi_attribute 34, 1
	.eabi_attribute 18, 4
	.file	"startup_gcc.c"
	.text
.Ltext0:
	.cfi_sections	.debug_frame
	.align	1
	.weak	UARTIntHandler
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	UARTIntHandler, %function
UARTIntHandler:
.LFB3:
	.file 1 "src/startup_gcc.c"
	.loc 1 84 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	.loc 1 84 0
	nop
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE3:
	.size	UARTIntHandler, .-UARTIntHandler
	.align	1
	.weak	UARTIntHandler1
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	UARTIntHandler1, %function
UARTIntHandler1:
.LFB4:
	.loc 1 85 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	.loc 1 85 0
	nop
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE4:
	.size	UARTIntHandler1, .-UARTIntHandler1
	.align	1
	.weak	UARTIntHandler2
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	UARTIntHandler2, %function
UARTIntHandler2:
.LFB5:
	.loc 1 86 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	.loc 1 86 0
	nop
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE5:
	.size	UARTIntHandler2, .-UARTIntHandler2
	.align	1
	.weak	UARTIntHandler3
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	UARTIntHandler3, %function
UARTIntHandler3:
.LFB6:
	.loc 1 87 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	.loc 1 87 0
	nop
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE6:
	.size	UARTIntHandler3, .-UARTIntHandler3
	.align	1
	.weak	UARTIntHandler4
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	UARTIntHandler4, %function
UARTIntHandler4:
.LFB7:
	.loc 1 88 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	.loc 1 88 0
	nop
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE7:
	.size	UARTIntHandler4, .-UARTIntHandler4
	.align	1
	.weak	UARTIntHandler5
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	UARTIntHandler5, %function
UARTIntHandler5:
.LFB8:
	.loc 1 89 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	.loc 1 89 0
	nop
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE8:
	.size	UARTIntHandler5, .-UARTIntHandler5
	.align	1
	.weak	UARTIntHandler6
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	UARTIntHandler6, %function
UARTIntHandler6:
.LFB9:
	.loc 1 90 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	.loc 1 90 0
	nop
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE9:
	.size	UARTIntHandler6, .-UARTIntHandler6
	.align	1
	.weak	UARTIntHandler7
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	UARTIntHandler7, %function
UARTIntHandler7:
.LFB10:
	.loc 1 91 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	.loc 1 91 0
	nop
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE10:
	.size	UARTIntHandler7, .-UARTIntHandler7
	.align	1
	.weak	ToneIntHandler
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	ToneIntHandler, %function
ToneIntHandler:
.LFB11:
	.loc 1 92 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	.loc 1 92 0
	nop
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE11:
	.size	ToneIntHandler, .-ToneIntHandler
	.align	1
	.weak	I2CIntHandler
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	I2CIntHandler, %function
I2CIntHandler:
.LFB12:
	.loc 1 93 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	.loc 1 93 0
	nop
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE12:
	.size	I2CIntHandler, .-I2CIntHandler
	.global	g_pfnVectors
	.section	.isr_vector,"a",%progbits
	.align	2
	.type	g_pfnVectors, %object
	.size	g_pfnVectors, 620
g_pfnVectors:
	.word	_estack
	.word	ResetISR
	.word	NmiSR
	.word	FaultISR
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	0
	.word	0
	.word	0
	.word	0
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	0
	.word	IntDefaultHandler
	.word	SysTickIntHandler
	.word	GPIOAIntHandler
	.word	GPIOBIntHandler
	.word	GPIOCIntHandler
	.word	GPIODIntHandler
	.word	GPIOEIntHandler
	.word	UARTIntHandler
	.word	UARTIntHandler1
	.word	IntDefaultHandler
	.word	I2CIntHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	GPIOFIntHandler
	.word	GPIOGIntHandler
	.word	GPIOHIntHandler
	.word	UARTIntHandler2
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	I2CIntHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	GPIOJIntHandler
	.word	GPIOKIntHandler
	.word	GPIOLIntHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	UARTIntHandler3
	.word	UARTIntHandler4
	.word	UARTIntHandler5
	.word	UARTIntHandler6
	.word	UARTIntHandler7
	.word	0
	.word	0
	.word	0
	.word	0
	.word	I2CIntHandler
	.word	I2CIntHandler
	.word	ToneIntHandler
	.word	IntDefaultHandler
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	0
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	GPIOMIntHandler
	.word	GPIONIntHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	0
	.word	GPIOPIntHandler
	.word	GPIOPIntHandler
	.word	GPIOPIntHandler
	.word	GPIOPIntHandler
	.word	GPIOPIntHandler
	.word	GPIOPIntHandler
	.word	GPIOPIntHandler
	.word	GPIOPIntHandler
	.word	GPIOQIntHandler
	.word	GPIOQIntHandler
	.word	GPIOQIntHandler
	.word	GPIOQIntHandler
	.word	GPIOQIntHandler
	.word	GPIOQIntHandler
	.word	GPIOQIntHandler
	.word	GPIOQIntHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.word	IntDefaultHandler
	.text
	.align	1
	.global	ResetISR
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	ResetISR, %function
ResetISR:
.LFB13:
	.loc 1 295 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 16
	@ frame_needed = 1, uses_anonymous_args = 0
	push	{r7, lr}
	.cfi_def_cfa_offset 8
	.cfi_offset 7, -8
	.cfi_offset 14, -4
	sub	sp, sp, #16
	.cfi_def_cfa_offset 24
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	.loc 1 302 0
	ldr	r3, .L18
	str	r3, [r7, #12]
	.loc 1 303 0
	ldr	r3, .L18+4
	str	r3, [r7, #8]
	b	.L12
.L13:
	.loc 1 304 0
	ldr	r2, [r7, #12]
	adds	r3, r2, #4
	str	r3, [r7, #12]
	ldr	r3, [r7, #8]
	adds	r1, r3, #4
	str	r1, [r7, #8]
	ldr	r2, [r2]
	str	r2, [r3]
.L12:
	.loc 1 303 0
	ldr	r3, [r7, #8]
	ldr	r2, .L18+8
	cmp	r3, r2
	bcc	.L13
	.loc 1 310 0
	.syntax unified
@ 310 "src/startup_gcc.c" 1
	    ldr     r0, =_bss
    ldr     r1, =_ebss
    mov     r2, #0
    .thumb_func
1:
    cmp     r0, r1
    it      lt
    strlt   r2, [r0], #4
    blt     1b
@ 0 "" 2
	.loc 1 326 0
	.thumb
	.syntax unified
	ldr	r3, .L18+12
	ldr	r3, [r3]
	ldr	r2, .L18+12
	.loc 1 328 0
	orr	r3, r3, #15728640
	.loc 1 326 0
	str	r3, [r2]
	.loc 1 333 0
	ldr	r2, .L18+16
	ldr	r3, .L18+20
	subs	r3, r2, r3
	asrs	r3, r3, #2
	str	r3, [r7]
	.loc 1 334 0
	movs	r3, #0
	str	r3, [r7, #4]
	b	.L14
.L15:
	.loc 1 335 0
	ldr	r2, .L18+20
	ldr	r3, [r7, #4]
	ldr	r3, [r2, r3, lsl #2]
	blx	r3
.LVL0:
	.loc 1 334 0
	ldr	r3, [r7, #4]
	adds	r3, r3, #1
	str	r3, [r7, #4]
.L14:
	.loc 1 334 0 is_stmt 0
	ldr	r2, [r7, #4]
	ldr	r3, [r7]
	cmp	r2, r3
	bcc	.L15
	.loc 1 340 0 is_stmt 1
	ldr	r2, .L18+24
	ldr	r3, .L18+28
	subs	r3, r2, r3
	asrs	r3, r3, #2
	str	r3, [r7]
	.loc 1 341 0
	movs	r3, #0
	str	r3, [r7, #4]
	b	.L16
.L17:
	.loc 1 342 0
	ldr	r2, .L18+28
	ldr	r3, [r7, #4]
	ldr	r3, [r2, r3, lsl #2]
	blx	r3
.LVL1:
	.loc 1 341 0
	ldr	r3, [r7, #4]
	adds	r3, r3, #1
	str	r3, [r7, #4]
.L16:
	.loc 1 341 0 is_stmt 0
	ldr	r2, [r7, #4]
	ldr	r3, [r7]
	cmp	r2, r3
	bcc	.L17
	.loc 1 347 0 is_stmt 1
	bl	main
	.loc 1 348 0
	nop
	adds	r7, r7, #16
	.cfi_def_cfa_offset 8
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	pop	{r7, pc}
.L19:
	.align	2
.L18:
	.word	_etext
	.word	_data
	.word	_edata
	.word	-536810104
	.word	__preinit_array_end
	.word	__preinit_array_start
	.word	__init_array_end
	.word	__init_array_start
	.cfi_endproc
.LFE13:
	.size	ResetISR, .-ResetISR
	.align	1
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	NmiSR, %function
NmiSR:
.LFB14:
	.loc 1 357 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	add	r7, sp, #0
	.cfi_def_cfa_register 7
.L21:
	.loc 1 361 0
	b	.L21
	.cfi_endproc
.LFE14:
	.size	NmiSR, .-NmiSR
	.align	1
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	FaultISR, %function
FaultISR:
.LFB15:
	.loc 1 373 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	add	r7, sp, #0
	.cfi_def_cfa_register 7
.L23:
	.loc 1 377 0
	b	.L23
	.cfi_endproc
.LFE15:
	.size	FaultISR, .-FaultISR
	.align	1
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	IntDefaultHandler, %function
IntDefaultHandler:
.LFB16:
	.loc 1 389 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	add	r7, sp, #0
	.cfi_def_cfa_register 7
.L25:
	.loc 1 393 0
	b	.L25
	.cfi_endproc
.LFE16:
	.size	IntDefaultHandler, .-IntDefaultHandler
	.global	__dso_handle
	.bss
	.align	2
	.type	__dso_handle, %object
	.size	__dso_handle, 4
__dso_handle:
	.space	4
	.align	2
heap_end.6702:
	.space	4
	.size	heap_end.6702, 4
	.text
	.align	1
	.global	_sbrk
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	_sbrk, %function
_sbrk:
.LFB17:
	.loc 1 407 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 24
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	sub	sp, sp, #28
	.cfi_def_cfa_offset 32
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	str	r0, [r7, #4]
	.loc 1 413 0
	ldr	r3, .L31
	ldr	r3, [r3]
	cmp	r3, #0
	bne	.L27
	.loc 1 414 0
	ldr	r3, .L31
	ldr	r2, .L31+4
	str	r2, [r3]
.L27:
	.loc 1 417 0
	ldr	r3, .L31
	ldr	r3, [r3]
	str	r3, [r7, #20]
	.loc 1 421 0
	ldr	r3, .L31
	ldr	r2, [r3]
	ldr	r3, [r7, #4]
	add	r2, r2, r3
	add	r3, r7, #8
	cmp	r2, r3
	bcs	.L28
	.loc 1 422 0
	ldr	r3, .L31
	ldr	r2, [r3]
	ldr	r3, [r7, #4]
	add	r3, r3, r2
	ldr	r2, .L31
	str	r3, [r2]
	.loc 1 423 0
	ldr	r3, [r7, #20]
	b	.L30
.L28:
	.loc 1 426 0
	movs	r3, #0
.L30:
	.loc 1 428 0
	mov	r0, r3
	adds	r7, r7, #28
	.cfi_def_cfa_offset 4
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
.L32:
	.align	2
.L31:
	.word	heap_end.6702
	.word	end
	.cfi_endproc
.LFE17:
	.size	_sbrk, .-_sbrk
	.align	1
	.weak	link
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	link, %function
link:
.LFB18:
	.loc 1 432 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 8
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	sub	sp, sp, #12
	.cfi_def_cfa_offset 16
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	str	r0, [r7, #4]
	str	r1, [r7]
	.loc 1 433 0
	mov	r3, #-1
	.loc 1 434 0
	mov	r0, r3
	adds	r7, r7, #12
	.cfi_def_cfa_offset 4
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE18:
	.size	link, .-link
	.align	1
	.weak	_close
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	_close, %function
_close:
.LFB19:
	.loc 1 438 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 8
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	sub	sp, sp, #12
	.cfi_def_cfa_offset 16
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	str	r0, [r7, #4]
	.loc 1 439 0
	mov	r3, #-1
	.loc 1 440 0
	mov	r0, r3
	adds	r7, r7, #12
	.cfi_def_cfa_offset 4
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE19:
	.size	_close, .-_close
	.align	1
	.weak	_fstat
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	_fstat, %function
_fstat:
.LFB20:
	.loc 1 444 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 8
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	sub	sp, sp, #12
	.cfi_def_cfa_offset 16
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	str	r0, [r7, #4]
	str	r1, [r7]
	.loc 1 445 0
	ldr	r3, [r7]
	mov	r2, #8192
	str	r2, [r3, #4]
	.loc 1 447 0
	movs	r3, #0
	.loc 1 448 0
	mov	r0, r3
	adds	r7, r7, #12
	.cfi_def_cfa_offset 4
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE20:
	.size	_fstat, .-_fstat
	.align	1
	.weak	_isatty
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	_isatty, %function
_isatty:
.LFB21:
	.loc 1 452 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 8
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	sub	sp, sp, #12
	.cfi_def_cfa_offset 16
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	str	r0, [r7, #4]
	.loc 1 453 0
	movs	r3, #1
	.loc 1 454 0
	mov	r0, r3
	adds	r7, r7, #12
	.cfi_def_cfa_offset 4
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE21:
	.size	_isatty, .-_isatty
	.align	1
	.weak	_lseek
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	_lseek, %function
_lseek:
.LFB22:
	.loc 1 458 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 16
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	sub	sp, sp, #20
	.cfi_def_cfa_offset 24
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	str	r0, [r7, #12]
	str	r1, [r7, #8]
	str	r2, [r7, #4]
	.loc 1 459 0
	movs	r3, #0
	.loc 1 460 0
	mov	r0, r3
	adds	r7, r7, #20
	.cfi_def_cfa_offset 4
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE22:
	.size	_lseek, .-_lseek
	.align	1
	.weak	_read
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	_read, %function
_read:
.LFB23:
	.loc 1 464 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 16
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	sub	sp, sp, #20
	.cfi_def_cfa_offset 24
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	str	r0, [r7, #12]
	str	r1, [r7, #8]
	str	r2, [r7, #4]
	.loc 1 465 0
	movs	r3, #0
	.loc 1 466 0
	mov	r0, r3
	adds	r7, r7, #20
	.cfi_def_cfa_offset 4
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE23:
	.size	_read, .-_read
	.align	1
	.weak	_write
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	_write, %function
_write:
.LFB24:
	.loc 1 470 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 16
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	sub	sp, sp, #20
	.cfi_def_cfa_offset 24
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	str	r0, [r7, #12]
	str	r1, [r7, #8]
	str	r2, [r7, #4]
	.loc 1 471 0
	ldr	r3, [r7, #4]
	.loc 1 472 0
	mov	r0, r3
	adds	r7, r7, #20
	.cfi_def_cfa_offset 4
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE24:
	.size	_write, .-_write
	.align	1
	.weak	_kill
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	_kill, %function
_kill:
.LFB25:
	.loc 1 476 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 8
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	sub	sp, sp, #12
	.cfi_def_cfa_offset 16
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	str	r0, [r7, #4]
	str	r1, [r7]
	.loc 1 477 0
	nop
	.loc 1 478 0
	adds	r7, r7, #12
	.cfi_def_cfa_offset 4
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE25:
	.size	_kill, .-_kill
	.align	1
	.weak	_getpid
	.syntax unified
	.thumb
	.thumb_func
	.fpu fpv4-sp-d16
	.type	_getpid, %function
_getpid:
.LFB26:
	.loc 1 482 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 1, uses_anonymous_args = 0
	@ link register save eliminated.
	push	{r7}
	.cfi_def_cfa_offset 4
	.cfi_offset 7, -4
	add	r7, sp, #0
	.cfi_def_cfa_register 7
	.loc 1 483 0
	mov	r3, #-1
	.loc 1 484 0
	mov	r0, r3
	mov	sp, r7
	.cfi_def_cfa_register 13
	@ sp needed
	ldr	r7, [sp], #4
	.cfi_restore 7
	.cfi_def_cfa_offset 0
	bx	lr
	.cfi_endproc
.LFE26:
	.size	_getpid, .-_getpid
	.weak	GPIOQIntHandler
	.weak	GPIOPIntHandler
	.weak	GPIONIntHandler
	.weak	GPIOMIntHandler
	.weak	GPIOLIntHandler
	.weak	GPIOKIntHandler
	.weak	GPIOJIntHandler
	.weak	GPIOHIntHandler
	.weak	GPIOGIntHandler
	.weak	GPIOFIntHandler
	.weak	GPIOEIntHandler
	.weak	GPIODIntHandler
	.weak	GPIOCIntHandler
	.weak	GPIOBIntHandler
	.weak	GPIOAIntHandler
	.weak	SysTickIntHandler
.Letext0:
	.file 2 "/home/ben/gcc-arm/arm-none-eabi/include/machine/_default_types.h"
	.file 3 "/home/ben/gcc-arm/arm-none-eabi/include/sys/lock.h"
	.file 4 "/home/ben/gcc-arm/arm-none-eabi/include/sys/_types.h"
	.file 5 "/home/ben/gcc-arm/lib/gcc/arm-none-eabi/7.3.1/include/stddef.h"
	.file 6 "/home/ben/gcc-arm/arm-none-eabi/include/sys/reent.h"
	.file 7 "/home/ben/gcc-arm/arm-none-eabi/include/sys/_stdint.h"
	.file 8 "/home/ben/gcc-arm/arm-none-eabi/include/sys/_timeval.h"
	.file 9 "/home/ben/gcc-arm/arm-none-eabi/include/sys/types.h"
	.file 10 "/home/ben/gcc-arm/arm-none-eabi/include/time.h"
	.file 11 "/home/ben/gcc-arm/arm-none-eabi/include/sys/stat.h"
	.section	.debug_info,"",%progbits
.Ldebug_info0:
	.4byte	0xf55
	.2byte	0x3
	.4byte	.Ldebug_abbrev0
	.byte	0x4
	.uleb128 0x1
	.4byte	.LASF206
	.byte	0xc
	.4byte	.LASF207
	.4byte	.LASF208
	.4byte	.Ltext0
	.4byte	.Letext0
	.4byte	.Ldebug_line0
	.uleb128 0x2
	.byte	0x1
	.byte	0x6
	.4byte	.LASF0
	.uleb128 0x2
	.byte	0x1
	.byte	0x8
	.4byte	.LASF1
	.uleb128 0x2
	.byte	0x2
	.byte	0x5
	.4byte	.LASF2
	.uleb128 0x2
	.byte	0x2
	.byte	0x7
	.4byte	.LASF3
	.uleb128 0x2
	.byte	0x4
	.byte	0x5
	.4byte	.LASF4
	.uleb128 0x3
	.4byte	.LASF8
	.byte	0x2
	.byte	0x4f
	.4byte	0x53
	.uleb128 0x2
	.byte	0x4
	.byte	0x7
	.4byte	.LASF5
	.uleb128 0x2
	.byte	0x8
	.byte	0x5
	.4byte	.LASF6
	.uleb128 0x2
	.byte	0x8
	.byte	0x7
	.4byte	.LASF7
	.uleb128 0x3
	.4byte	.LASF9
	.byte	0x2
	.byte	0xc8
	.4byte	0x5a
	.uleb128 0x4
	.byte	0x4
	.byte	0x5
	.ascii	"int\000"
	.uleb128 0x2
	.byte	0x4
	.byte	0x7
	.4byte	.LASF10
	.uleb128 0x2
	.byte	0x8
	.byte	0x4
	.4byte	.LASF11
	.uleb128 0x5
	.byte	0x4
	.uleb128 0x3
	.4byte	.LASF12
	.byte	0x3
	.byte	0x22
	.4byte	0x95
	.uleb128 0x6
	.byte	0x4
	.4byte	0x9b
	.uleb128 0x7
	.4byte	.LASF128
	.byte	0x1
	.uleb128 0x3
	.4byte	.LASF13
	.byte	0x4
	.byte	0x1c
	.4byte	0x41
	.uleb128 0x3
	.4byte	.LASF14
	.byte	0x4
	.byte	0x20
	.4byte	0x41
	.uleb128 0x3
	.4byte	.LASF15
	.byte	0x4
	.byte	0x2c
	.4byte	0x41
	.uleb128 0x3
	.4byte	.LASF16
	.byte	0x4
	.byte	0x36
	.4byte	0x33
	.uleb128 0x3
	.4byte	.LASF17
	.byte	0x4
	.byte	0x3a
	.4byte	0x3a
	.uleb128 0x3
	.4byte	.LASF18
	.byte	0x4
	.byte	0x3d
	.4byte	0x3a
	.uleb128 0x3
	.4byte	.LASF19
	.byte	0x4
	.byte	0x49
	.4byte	0x3a
	.uleb128 0x3
	.4byte	.LASF20
	.byte	0x4
	.byte	0x58
	.4byte	0x48
	.uleb128 0x3
	.4byte	.LASF21
	.byte	0x4
	.byte	0x64
	.4byte	0xb7
	.uleb128 0x3
	.4byte	.LASF22
	.byte	0x4
	.byte	0x72
	.4byte	0x41
	.uleb128 0x8
	.4byte	.LASF23
	.byte	0x5
	.2byte	0x165
	.4byte	0x7a
	.uleb128 0x9
	.byte	0x4
	.byte	0x4
	.byte	0xa6
	.4byte	0x13a
	.uleb128 0xa
	.4byte	.LASF24
	.byte	0x4
	.byte	0xa8
	.4byte	0x10f
	.uleb128 0xa
	.4byte	.LASF25
	.byte	0x4
	.byte	0xa9
	.4byte	0x13a
	.byte	0
	.uleb128 0xb
	.4byte	0x2c
	.4byte	0x14a
	.uleb128 0xc
	.4byte	0x7a
	.byte	0x3
	.byte	0
	.uleb128 0xd
	.byte	0x8
	.byte	0x4
	.byte	0xa3
	.4byte	0x16b
	.uleb128 0xe
	.4byte	.LASF26
	.byte	0x4
	.byte	0xa5
	.4byte	0x73
